test_pitchingBox_multiPhase/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolverLibs   ("libfvMotionSolvers.so");

solver              velocityLaplacian;

diffusivity     inverseDistance (floatingObject);
// dynamicFvMesh       dynamicMotionSolverFvMesh;

// motionSolverLibs   (rigidBodyMeshMotion);

// motionSolver       rigidBodyMotion;

// rigidBodyMotionCoeffs
// {
//     report          on;

//     solver
//     {
//         type Newmark;
//     }

//     accelerationRelaxation table
//     (
//         // time     relaxation-factor
//         (0          0)
//         (3.99999    0)
//         (4          0.7)
//     );

//     bodies
//     {
//         floatingObject
//         {
//             type            cuboid;
//             parent          root;

//             // Cuboid dimensions
//             Lx              0.3;
//             Ly              0.2;
//             Lz              0.5;

//             // Density of the cuboid
//             rho             500;

//             // Cuboid mass
//             mass            #eval{ $rho*$Lx*$Ly*$Lz };
//             L               ($Lx $Ly $Lz);
//             centreOfMass    (0 0 0.25);
//             transform       (1 0 0 0 1 0 0 0 1) (0.5 0.45 0.1);

//             joint
//             {
//                 type            composite;
//                 joints
//                 (
//                     {
//                         type Py;
//                     }
//                     {
//                         type Ry;
//                     }
//                 );
//             }

//             patches         (floatingObject);
//             innerDistance   0.05;
//             outerDistance   0.35;
//         }
//     }
// }


// ************************************************************************* //
