test_pitchingBox_multiPhase/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    seabed
    {
        type            noSlip;
    }
    leftBoundary
    {
        type            zeroGradient;
    }
    rightBoundary
    {
        type            zeroGradient;
    }
    // leftBoundary
    // {
    //     type            inletOutlet;
    //     inletValue      uniform (0 0 0);
    //     value           uniform (0 0 0);
    // }
    // rightBoundary
    // {
    //     type            inletOutlet;
    //     inletValue      uniform (0 0 0);
    //     value           uniform (0 0 0);
    // }
    front
    {
        type empty;
    }
    back
    {
        type empty;
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    floatingObject
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
