test_pitchingBox_multiPhase/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    seabed
    {
        type            fixedFluxPressure;
    }
     leftBoundary
    {
        type            zeroGradient;
    }
    rightBoundary
    {
        type            zeroGradient;
    }
    
    front
    {
        type empty;
    }

    back
    {
        type empty;
    }

    atmosphere
    {
        type            totalPressure;
        p0              uniform 0;
    }

    floatingObject
    {
        type            fixedFluxPressure;
    }
}


// ************************************************************************* //
