test_pitchingBox_multiPhase/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    seabed
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

     leftBoundary
    {
        type            zeroGradient;
    }
    rightBoundary
    {
        type            zeroGradient;
    }
    
    front
    {
        type empty;
    }
    back
    {
        type empty;
    }
    atmosphere
    {
        type            calculated;
        value           uniform 0;
    }

    floatingObject
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
