test_pitchingBox_multiPhase/0.orig/pointMotionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointMotionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    seabed
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    atmosphere
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    leftBoundary
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    rightBoundary
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    floatingObject
    {
        type            angularOscillatingVelocity;
        axis            (0 0 -1);
        origin          (500 150 0);
        angle0          0;
        amplitude       0.2;
        omega           1;
        value           uniform (0 0 0);
    }

    front
    {
        type empty;
    }
    back
    {
        type empty;
    }
}


// ************************************************************************* //
