test_pitchingBox_multiPhase/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    boxToCell
    {
        box (-1000 -1000 -100) (2000 150 100);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }

    // boxToCell
    // {
    //     box (0.7 0.8 -100) (100 100 0.65);
    //     fieldValues ( volScalarFieldValue alpha.water 1 );
    // }
);


// ************************************************************************* //
